// Generated by jextract

package io.github.dsheirer.sdrplay.api;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class sdrplay_api_RxChannelParamsT {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            C_INT.withName("bwType"),
            C_INT.withName("ifType"),
            C_INT.withName("loMode"),
            MemoryLayout.structLayout(
                C_INT.withName("gRdB"),
                C_CHAR.withName("LNAstate"),
                C_CHAR.withName("syncUpdate"),
                MemoryLayout.paddingLayout(16),
                C_INT.withName("minGr"),
                MemoryLayout.structLayout(
                    C_FLOAT.withName("curr"),
                    C_FLOAT.withName("max"),
                    C_FLOAT.withName("min")
                ).withName("gainVals")
            ).withName("gain"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.structLayout(
                C_DOUBLE.withName("rfHz"),
                C_CHAR.withName("syncUpdate"),
                MemoryLayout.paddingLayout(56)
            ).withName("rfFreq"),
            MemoryLayout.structLayout(
                C_CHAR.withName("dcCal"),
                C_CHAR.withName("speedUp"),
                MemoryLayout.paddingLayout(16),
                C_INT.withName("trackTime"),
                C_INT.withName("refreshRateTime")
            ).withName("dcOffsetTuner"),
            MemoryLayout.paddingLayout(32)
        ).withName("tunerParams"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                C_CHAR.withName("DCenable"),
                C_CHAR.withName("IQenable")
            ).withName("dcOffset"),
            MemoryLayout.structLayout(
                C_CHAR.withName("enable"),
                C_CHAR.withName("decimationFactor"),
                C_CHAR.withName("wideBandSignal")
            ).withName("decimation"),
            MemoryLayout.paddingLayout(24),
            MemoryLayout.structLayout(
                C_INT.withName("enable"),
                C_INT.withName("setPoint_dBfs"),
                C_SHORT.withName("attack_ms"),
                C_SHORT.withName("decay_ms"),
                C_SHORT.withName("decay_delay_ms"),
                C_SHORT.withName("decay_threshold_dB"),
                C_INT.withName("syncUpdate")
            ).withName("agc"),
            C_INT.withName("adsbMode")
        ).withName("ctrlParams"),
        MemoryLayout.structLayout(
            C_CHAR.withName("biasTEnable")
        ).withName("rsp1aTunerParams"),
        MemoryLayout.paddingLayout(24),
        MemoryLayout.structLayout(
            C_CHAR.withName("biasTEnable"),
            MemoryLayout.paddingLayout(24),
            C_INT.withName("amPortSel"),
            C_INT.withName("antennaSel"),
            C_CHAR.withName("rfNotchEnable"),
            MemoryLayout.paddingLayout(24)
        ).withName("rsp2TunerParams"),
        MemoryLayout.structLayout(
            C_CHAR.withName("biasTEnable"),
            MemoryLayout.paddingLayout(24),
            C_INT.withName("tuner1AmPortSel"),
            C_CHAR.withName("tuner1AmNotchEnable"),
            C_CHAR.withName("rfNotchEnable"),
            C_CHAR.withName("rfDabNotchEnable"),
            MemoryLayout.paddingLayout(8)
        ).withName("rspDuoTunerParams"),
        MemoryLayout.structLayout(
            C_INT.withName("hdrBw")
        ).withName("rspDxTunerParams"),
        MemoryLayout.paddingLayout(32)
    );
    public static MemoryLayout $LAYOUT() {
        return sdrplay_api_RxChannelParamsT.$struct$LAYOUT;
    }
    public static MemorySegment tunerParams$slice(MemorySegment seg) {
        return seg.asSlice(0, 72);
    }
    public static MemorySegment ctrlParams$slice(MemorySegment seg) {
        return seg.asSlice(72, 32);
    }
    public static MemorySegment rsp1aTunerParams$slice(MemorySegment seg) {
        return seg.asSlice(104, 1);
    }
    public static MemorySegment rsp2TunerParams$slice(MemorySegment seg) {
        return seg.asSlice(108, 16);
    }
    public static MemorySegment rspDuoTunerParams$slice(MemorySegment seg) {
        return seg.asSlice(124, 12);
    }
    public static MemorySegment rspDxTunerParams$slice(MemorySegment seg) {
        return seg.asSlice(136, 4);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.ofScope(scope)); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.ofScope(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


